//JOB1     JOB  CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=IEFBR14
//DD1      DD   DSN=TEST.FILE,DISP=SHR
//* コメント行
//STEP2    EXEC PGM=MYPROG,PARM='ABC,DEF'
