//JOB1     JOB  CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=IEFBR14
//DD1      DD   DSN=TEST.FILE,DISP=SHR
//* コメント行
//STEP2    EXEC PGM=MYPROG,PARM='ABC,DEF'
//DD2      DD   DSN=NEW.FILE,DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(10,5),RLSE)
//DD3      DD   DSN=REF.FILE,DISP=SHR,DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//STEP3    EXEC PGM=ANOTHER,PARM=(OPT1,OPT2)
//DD4      DD   DSN=OUT.FILE,DISP=(NEW,CATLG)
