//JOB1     JOB  CLASS=A,MSGCLASS=X
//S1       EXEC PGM=CHECKER
//OUT      DD   DSN=CHECK.RESULT,DISP=(NEW,CATLG)
// IF (S1.RC = 0) THEN
//STEPA    EXEC PGM=SUCCESS_PATH
//WORK     DD   DSN=SHARED.WORK,DISP=(NEW,CATLG)
// ELSE
//STEPB    EXEC PGM=FAILURE_PATH
//WORK2    DD   DSN=SHARED.WORK,DISP=(NEW,CATLG)
// ENDIF
//S2       EXEC PGM=CLEANUP,COND=(4,LT)
//OLDOUT   DD   DSN=CHECK.RESULT,DISP=(NEW,CATLG)
