//JOB1     JOB  CLASS=A,MSGCLASS=X
//PROCA    PROC LIB=DEFAULT.LIB
//STEP05   EXEC PGM=IEFBR14
//IN1      DD   DSN=&LIB..INPUT,
//            DISP=SHR
//         DD   DSN=&LIB..INPUT2,DISP=SHR
//         PEND
//RUN1     EXEC PROCA
//RUN1.IN1 DD   DSN=OVERRIDE.INPUT,DISP=SHR
//STEP2    EXEC PGM=MYPROG
//OUT1     DD   DSN=WORK.FILE,DISP=(NEW,CATLG,DELETE)
//STEP3    EXEC PGM=MYPROG2
//OUT2     DD   DSN=WORK.FILE,DISP=(NEW,CATLG,DELETE)
